app/Http/Controllers/AppearanceController.php

    public function index()
    {
        $data['products']   = Product::with('advantages', 'details', 'descriptions')
            ->where('active_status', 1)
            ->get();
---
select * from `products` where `active_status` = 1 and `products`.`deleted_at` is null