app/Http/Controllers/AppearanceController.php

select * from `products` where `active_status` = 1 and `pinned` = 1 and `products`.`deleted_at` is null
select * from `meet_teams` where `active_status` = '1' and `meet_teams`.`deleted_at` is null order by `created_at` asc limit 3
select * from `product_guarantees` where `active_status` = '1' and `product_guarantees`.`deleted_at` is null order by `created_at` asc limit 3
select * from `home_paveshops` where `active_status` = '1' and `home_paveshops`.`deleted_at` is null limit 1
select * from `sliders` where `active_status` = '1' and `sliders`.`deleted_at` is null limit 1
---
    public function index()
    {
        $data['products'] = Product::with('advantages', 'details', 'descriptions')
            ->where('active_status', 1)
            ->where('pinned', 1)
            ->get();
        $data['meet_teams'] = MeetTeam::where('active_status', '1')
            ->oldest()
            ->take(3)
            ->get();
        $data['gurantees'] = ProductGuarantee::where('active_status', '1')
            ->oldest()
            ->take(3)
            ->get();
        $data['home_pave'] = HomePaveshop::where('active_status', '1')->first();
        $data['slider'] = Slider::where('active_status', '1')->first();

select * from `products` where `active_status` = 1 and `products`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `products` where `active_status` = 1 and `products`.`deleted_at` is null
select * from `sliders` where `active_status` = '1' and `sliders`.`deleted_at` is null limit 1
---
    public function allProduct()
    {
        $data['products'] = Product::latest()
            ->where('active_status', 1)
            ->paginate(12);
        $data['slider'] = Slider::where('active_status', '1')->first();

select `id` from `categories` where `slug` = 'google-account' and `categories`.`deleted_at` is null limit 1
select * from `products` where `sub_category_id` = 4 and `active_status` = 1 and `products`.`deleted_at` is null limit 12 offset 0
select count(*) as aggregate from `products` where `sub_category_id` = 4 and `active_status` = 1 and `products`.`deleted_at` is null
select * from `categories` where `slug` = 'google-account' and `categories`.`deleted_at` is null limit 1
select * from `sub_category_descriptions` where `subcategory_id` = 4 and `active_status` = 1 and `sub_category_descriptions`.`deleted_at` is null order by `created_at` desc
---
    public function categoryWiseProduct($slug)
    {
        $data['category'] = Category::where('slug', $slug)->first();
        $data['products'] = Product::where('sub_category_id', $data['category']->id)
            ->where('active_status', 1)
            ->paginate(12);
        $data['slider'] = Slider::where('active_status', '1')->first();

        $id = Category::where('slug', $slug)->value('id');
        $data['descriptions'] = SubCategoryDescription::where('subcategory_id', $id)
            ->where('active_status', 1)
            ->latest()
            ->get();

select * from `reviews` where `product_slug` = 'gmail-acoount' and `reviews`.`deleted_at` is null limit 5
select * from `categories` where `slug` = 'google-account' and `categories`.`deleted_at` is null limit 1
select * from `categories` where `categories`.`id` in (4) and `categories`.`deleted_at` is null
select * from `products` where `active_status` = 1 and `slug` = 'gmail-acoount' and `products`.`deleted_at` is null limit 1
---
    public function productDetails($category_slug, $product_slug)
    {
        $data['reviews'] = Review::where('product_slug', $product_slug)
            ->take(5)
            ->get();
        $data['category'] = Category::where('slug', $category_slug)->first();
        $data['product'] = Product::with('advantages', 'details', 'descriptions', 'subcategory')
            ->where('active_status', 1)
            ->where('slug', $product_slug)
            ->first();

select * from `products` where `products`.`id` = '1' and `products`.`deleted_at` is null limit 1
---
    public function addToCard(Request $request)
    {
        $product = Product::findOrFail($request->product_id);

select * from `about_us` where `active_status` = 1 and `about_us`.`deleted_at` is null limit 1
---
    public function aboutUs()
    {
        $data['about_us'] = AboutUs::where('active_status', 1)->first();