app/Http/Controllers/CategoryController.php

    public function index()
    {
        $data['categories'] = Category::orderBy('name', 'ASC')->where('parent_id', null)->paginate(10);
---
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null order by `name` asc limit 10 offset 0
select count(*) as aggregate from `categories` where `parent_id` is null and `categories`.`deleted_at` is null

    public function updateCategory(Request $request)
    {

        Validator::make($request->all(), [
            'name' => "required|string|max:255|unique:categories,name,{$request->id},id",
            'active_status' =>  'required|in:0,1',
        ],[
            'name.required' => 'Please Enter The Name',
            'active_status.required' =>  'Please Select The Status',
        ])->validate();

        // Add the data to the database
        $category = Category::findOrFail($request->id)->update([
            'name' => $request->name,
            'slug' => "#",
            'active_status' =>  $request->active_status,
            'updated_by' => Auth::id()
        ]);
---
select * from `categories` where `categories`.`id` = '1' and `categories`.`deleted_at` is null limit 1

    public function indexSubCategory()
    {
        $data['categories'] = Category::where('parent_id', null)->get();
        $data['subCategories'] = Category::with('category')->where('parent_id','!=', null)->paginate(10);
---
select count(*) as aggregate from `categories` where `parent_id` is not null and `categories`.`deleted_at` is null
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null

    public function getSubCategoryAjax(Request $request)
    {
        $data['data'] = Category::with('category')
        ->where('parent_id', $request->category_id)
        ->where('parent_id','!=', null)
        ->get();
---
select * from `categories` where `parent_id` = '3' and `parent_id` is not null and `categories`.`deleted_at` is null