app/Http/Controllers/HomePageController.php

    public function showDetails()
    {
        $data['details']= HomePaveshop::latest()->paginate(10);
---
select * from `home_paveshops` where `home_paveshops`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `home_paveshops` where `home_paveshops`.`deleted_at` is null

    public function updateDetails(Request $request)
    {
        Validator::make($request->all(), [
            'title' => 'required|string|max:255',
            'description' => 'required|string',
            'active_status' =>  'required|in:0,1',
        ],[
            'title.required' => 'Please Enter The Title',
            'description.required' => 'Please Enter The Description',
            'active_status.required' =>  'Please Select The Status',
        ])->validate();


        $homePabeshop = HomePaveshop::findOrFail($request->edit_e)->update([
            'title' => $request->title,
            'description' => $request->description,
            'active_status' =>  $request->active_status,
            'updated_by' => Auth::id()
        ]);
---
select * from `home_paveshops` where `home_paveshops`.`id` = '5' and `home_paveshops`.`deleted_at` is null limit 1

    public function meetTeam()
    {
        $data['members'] = MeetTeam::latest()->paginate(10);
---
select * from `meet_teams` where `meet_teams`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `meet_teams` where `meet_teams`.`deleted_at` is null

    public function updateTeamStatus($id, $status)
    {
        if ($status == 0) {
            $team = MeetTeam::findOrFail($id)->update([
                'active_status' =>  '1',
                'updated_by' => Auth::id()
            ]);

            if ($team == true) {
                $notification = [
                    'success' => "Status Activated Successfully.",
                ];
            } else {
                $notification = [
                    'error' => "Opps! There Is A Problem!",
                ];
            }
            return back()->with($notification);

        } elseif($status == 1) {
            $team = MeetTeam::findOrFail($id)->update([
                'active_status' =>  '0',
                'updated_by' => Auth::id()
            ]);
---
select * from `meet_teams` where `meet_teams`.`id` = '2' and `meet_teams`.`deleted_at` is null limit 1

    public function sliderIndex()
    {
        $data['subcategories'] = Category::all();
        $data['sliders'] = Slider::latest()->paginate(10);
---
select * from `categories` where `categories`.`deleted_at` is null
select * from `sliders` where `sliders`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sliders` where `sliders`.`deleted_at` is null

    public function updateSlider(Request $request)
    {
        Validator::make($request->all(), [
            'title' => 'required|string|max:255',
            'subcategory_id' => "required|numeric",
            'short_description' => 'required|string',
            'background_photo' => 'image|mimes:jpeg,png,jpg,gif,svg|max:5120',
            'photo_alt' => 'required|string|max:255',
            'active_status' => 'required|in:0,1',
        ],[
            'title.required' => 'Please Enter The Title',
            'subcategory_id.required' => 'Please Select The Subcategory',
            'short_description.required' => 'Please Enter The Short Description',
            'photo_alt.required' => 'Please Enter The Photo Alternative',
            'active_status.required' =>  'Please Select The Status',
        ])->validate();

        if ($request->hasFile('background_photo')) {
            $id = $request->edit_id;

            $photo = Slider::where('id', $id)->value('background_photo');
            File::delete($photo);
            $image = '';
            if ($request->file('background_photo')) {
                $image = uploadPlease($request->file('background_photo'));
            }

            $slider = Slider::findOrFail($id)->update([
                'title' => $request->title,
                'subcategory_id' => $request->subcategory_id,
                'short_description' => $request->short_description,
                'background_photo' => $image,
                'photo_alt' =>  $request->photo_alt,
                'active_status' =>  $request->active_status,
                'updated_by' => Auth::id()
            ]);
---
select `background_photo` from `sliders` where `id` = '3' and `sliders`.`deleted_at` is null limit 1
select * from `sliders` where `sliders`.`id` = '3' and `sliders`.`deleted_at` is null limit 1

    public function updateSliderStatus($id, $status)
    {
        if ($status == 0) {
            $team = Slider::findOrFail($id)->update([
                'active_status' =>  '1',
                'updated_by' => Auth::id()
            ]);

            if ($team == true) {
                $notification = [
                    'success' => "Status Activated Successfully.",
                ];
            } else {
                $notification = [
                    'error' => "Opps! There Is A Problem!",
                ];
            }
            return back()->with($notification);

        } elseif($status == 1) {
            $team = Slider::findOrFail($id)->update([
                'active_status' =>  '0',
                'updated_by' => Auth::id()
            ]);
---
select * from `sliders` where `sliders`.`id` = '4' and `sliders`.`deleted_at` is null limit 1

    public function deleteSlider($id)
    {
        $photo = Slider::where('id', $id)->value('background_photo');
        File::delete($photo);

        $delete = Slider::findOrFail($id)->delete();
---
select `background_photo` from `sliders` where `id` = '5' and `sliders`.`deleted_at` is null limit 1
select * from `sliders` where `sliders`.`id` = '5' and `sliders`.`deleted_at` is null limit 1
update `sliders` set `deleted_at` = '2023-08-24 20:12:21', `sliders`.`updated_at` = '2023-08-24 20:12:21' where `id` = 5

    public function deleteAboutUs($id)
    {
        $delete = FAQ::findOrFail($id)->delete();
---
select * from `f_a_q_s` where `f_a_q_s`.`id` = '3' and `f_a_q_s`.`deleted_at` is null limit 1
update `f_a_q_s` set `deleted_at` = '2023-08-24 21:40:57', `f_a_q_s`.`updated_at` = '2023-08-24 21:40:57' where `id` = 3