app/Http/Controllers/MyAccountController.php

    public function orders()
    {
        $data['orders'] = Order::where('user_id', Auth::id())->get();
---
select * from `orders` where `user_id` = 1 and `orders`.`deleted_at` is null