app/Http/Controllers/ProductController.php

    public function index()
    {
        $data['products'] = Product::with('subcategory','category')->latest()->paginate(10);
        $data['categories'] = Category::where('parent_id', null)->get();
        $data['subCategories'] = Category::with('category')->where('parent_id','!=', null)->paginate(10);
---
select * from `categories` where `categories`.`id` in (2, 4, 5, 7, 8, 9, 10) and `categories`.`deleted_at` is null
select * from `products` where `products`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `categories` where `parent_id` is not null and `categories`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `categories` where `parent_id` is not null and `categories`.`deleted_at` is null

    public function updateProduct(Request $request)
    {

        $request->validate( [
            'category_id' => "required|numeric",
            'sub_category_id' => "required|numeric",
            'name' => "required|string|max:255",
            'slug' => "required|string|max:255|unique:products,slug,{$request->id},id",
            'selling_price' =>  'required|numeric',
            'active_status' =>  'required|in:0,1',
        ],[
            'category_id.required' => "Product Category Is Required",
            'sub_category_id.required' => "Product Subcategory Is Required",
            'name.required' => "Product Name Is Required",
            'slug.required' => "Product Slug Is Required",
            'selling_price.required' =>  'Product Selling Price Is Required',
            'active_status.required' =>  'Product Active Status Is Required',
        ]);


        $product = Product::findOrFail($request->id);
---
select * from `products` where `products`.`id` = '8' and `products`.`deleted_at` is null limit 1

    public function productAdvantages($product_id)
    {
        $data['product'] = Product::findOrFail($product_id);
        $data['advantages'] = ProductAdvantage::where('product_id', $product_id)->paginate(10);
---
select * from `products` where `products`.`id` = '5' and `products`.`deleted_at` is null limit 1
select * from `product_advantages` where `product_id` = '5' and `product_advantages`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `product_advantages` where `product_id` = '5' and `product_advantages`.`deleted_at` is null

    public function storeProductAdvantage(Request $request)
    {
        $request->validate( [
            'product_id' => "required|numeric",
            'title' => "required|string|max:255",
            'active_status' =>  'required|in:0,1',
        ],[
            'product_id.required' => "Product Id Is Required",
            'title.required' => "Advantage Title Is Required",
            'active_status.required' =>  'Advantage Active Status Is Required',
        ]);

        $advantage = ProductAdvantage::create([
            'product_id' => $request->product_id,
            'title' => $request->title,
            'active_status' => $request->active_status,
            'created_by' => Auth::id()
        ]);
---
insert into `product_advantages` (`product_id`, `title`, `active_status`, `created_by`, `updated_at`, `created_at`) values ('3', '500 Bulk Account', '1', 1, '2023-08-24 20:40:55', '2023-08-24 20:40:55')

    public function updateProductAdvantage(Request $request)
    {
        $request->validate( [
            'product_id' => "required|numeric",
            'title' => "required|string|max:255",
            'active_status' =>  'required|in:0,1',
        ],[
            'product_id.required' => "Product Id Is Required",
            'title.required' => "Advantage Title Is Required",
            'active_status.required' =>  'Advantage Active Status Is Required',
        ]);

        $advantage = ProductAdvantage::findOrFail($request->id)->update([
            'product_id' => $request->product_id,
            'title' => $request->title,
            'active_status' => $request->active_status,
            'updated_by' => Auth::id()
        ]);
---
select * from `product_advantages` where `product_advantages`.`id` = '10' and `product_advantages`.`deleted_at` is null limit 1

    public function productDetailsIndex($product_id)
    {
        $data['product'] = Product::findOrFail($product_id);
        $data['productDetails'] = ProductDetail::where('product_id', $product_id)->paginate(10);
---
select * from `products` where `products`.`id` = '2' and `products`.`deleted_at` is null limit 1
select * from `product_details` where `product_id` = '2' and `product_details`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `product_details` where `product_id` = '2' and `product_details`.`deleted_at` is null

    public function deleteProduct($product_id)
    {
        ProductAdvantage::where('product_id', $product_id)->delete();
        Product::findOrFail($product_id)->delete();
---
update `product_advantages` set `deleted_at` = '2023-08-24 20:47:45', `product_advantages`.`updated_at` = '2023-08-24 20:47:45' where `product_id` = '8' and `product_advantages`.`deleted_at` is null
select * from `products` where `products`.`id` = '8' and `products`.`deleted_at` is null limit 1
update `products` set `deleted_at` = '2023-08-24 20:47:45', `products`.`updated_at` = '2023-08-24 20:47:45' where `id` = 8

    public function productDescription($product_id)
    {
        $data['product'] = Product::findOrFail($product_id);
        $data['productDescriptions'] = ProductDescription::where('product_id', $product_id)->paginate(10);
---
select * from `products` where `products`.`id` = '2' and `products`.`deleted_at` is null limit 1
select * from `product_descriptions` where `product_id` = '2' and `product_descriptions`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `product_descriptions` where `product_id` = '2' and `product_descriptions`.`deleted_at` is null

    public function storeProductDescription(Request $request)
    {

        $request->validate([
            "product_id" => "required|integer",
            "active_status" => "required|integer",
            "content" => "required|string"
        ],[
            "product_id.required" => "Required",
            "active_status.required" => "Active Status Is Required",
            "content.required" => "Please Write Or Past The Content"
        ]);

        $description = ProductDescription::create([
            "product_id" => $request->product_id,
            "active_status" => $request->active_status,
            "content" => $request->content,
            "created_by" => Auth::id(),
        ]);
---
insert into `product_descriptions` (`product_id`, `active_status`, `content`, `created_by`, `updated_at`, `created_at`) values ('2', '1', '<h3>Introduction</h3>\r\n\r\n<p><strong>Gmail</strong>&nbsp;is a free email service provided by Google. In many ways, Gmail is like any other email service: You can&nbsp;<strong>send and receive emails</strong>,&nbsp;<strong>block spam</strong>, create an&nbsp;<strong>address book</strong>, and perform other basic email tasks. But it also has some more unique features that help make it one of the most popular online email services.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3>Google accounts</h3>\r\n\r\n<p>Creating a&nbsp;<strong>Google account</strong>&nbsp;is needed to access&nbsp;<strong>Gmail</strong>&nbsp;because it is just one of the many services offered by Google to registered users. Signing up for a Google account is free and easy, and naming your new&nbsp;<strong>Gmail address</strong>&nbsp;will be a part of the sign-up process. This means whenever you&#39;re signed in to Gmail, you are automatically signed in to your Google account. You&#39;ll be able to easily access other Google services like&nbsp;<strong>Google Docs</strong>,&nbsp;<strong>Calendar</strong>, and<strong>&nbsp;YouTube</strong>.</p>', 1, '2023-08-24 22:07:52', '2023-08-24 22:07:52')

    public function updateProductDescription(Request $request)
    {

        $request->validate([
            "product_id" => "required|integer",
            "active_status" => "required|integer",
            "content" => "required|string"
        ],[
            "product_id.required" => "Required",
            "active_status.required" => "Active Status Is Required",
            "content.required" => "Please Write Or Past The Content"
        ]);

        $description = ProductDescription::findOrFail($request->id)->update([
            "product_id" => $request->product_id,
            "active_status" => $request->active_status,
            "content" => $request->content,
            "updated_by" => Auth::id(),
        ]);
---
select * from `product_descriptions` where `product_descriptions`.`id` = '2' and `product_descriptions`.`deleted_at` is null limit 1

    public function indexCoupon()
    {

        $data['coupons'] = Coupon::latest()->paginate(15);
        $data['products'] = Product::latest()->get();
---
select * from `coupons` where `coupons`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `coupons` where `coupons`.`deleted_at` is null
select * from `products` where `products`.`deleted_at` is null order by `created_at` desc

    public function updateCoupon(Request $request)
    {
        Validator::make($request->all(), [
            'coupon_name' => 'required|string',
            'coupon_code' => 'required|regex:/^\S*$/u',
            'start_date' => 'required|string',
            'end_date' => 'required|string|max:20',
            'product_id' => 'required|numeric',
            'limit' => 'required|numeric',
            'coupon_discount' => 'required|numeric|between:1,100',
            'active_status' =>  'required|in:0,1',
        ],[
            'coupon_name.required' => 'Please Enter The Coupon Name',
            'coupon_code.required' => 'Please Enter The Coupon Code',
            'start_date.required' => 'Please Enter Start Date',
            'end_date.required' => 'Please Enter End Date',
            'limit.required' => 'Please Enter Limit',
            'product_id.required' => 'Please Select The Products',
            'coupon_discount.required' => 'Please Enter Coupon Discount',
            'active_status.required' =>  'Please Select The Status',
        ])->validate();

        $coupon = Coupon::findOrFail($request->edit_id);
---
select * from `coupons` where `coupons`.`id` = '2' and `coupons`.`deleted_at` is null limit 1